---
kind: property
id: P:Autodesk.Revit.DB.PolylineSegments.StartParameter
source: html/201caacd-4c20-d1ef-ebe7-648183454720.htm
---
# Autodesk.Revit.DB.PolylineSegments.StartParameter Property

Parameter associated with the start point.

## Syntax (C#)
```csharp
public double StartParameter { get; }
```